[
    {
        "title": "When you feel tired",
        "heading": "Dear Tia,",
        "content": "You're reading this because you must be tired, the kind of tired that sleep doesn’t fix, where even the simplest tasks feel like climbing a mountain. I wish I could hold you right now, let you rest in my arms, play with your hair, give you back scratches, and gently caress your arm. But since I can't, let me tell you this instead: it's okay to feel tired.\n You've been strong for so long, doing your best even when no one sees the weight you carry. Allah sees every struggle you hide behind your smile, and He never asks you to bear more than you can handle, even when it feels overwhelming. You are human, and being human means you need to pause, breathe, and let go. You deserve rest and there is no shame in taking it.\nRest, my love. Allah has you, and so do I. Remember that you can come to me with anything. I will listen every single time. I would drop everything just to hold you, even if only through these words. "
    },
    {
        "title": "When you feel far from Allah",
        "heading": "My dear baby,",
        "content": "There’s a certain loneliness that comes with feeling distant from Allah, the ache of being separated from the One who knows you better than you know yourself. You must be feeling that loneliness right now, wondering if you’ve gone too far. Let me remind you: Allah never leaves you. He misses you more than you miss Him.\nEven if you walked away, He has never left, and He has never stopped listening. His mercy is greater than every mistake you've ever made. The door to Allah is never closed, ya albe. Not after days, not after years. As long as your heart still beats, you can return to Him and He is waiting for you, ready to hold your hand as if you never left.\nYou don’t need to be perfect. No one is. And I know you're the strongest believer in that truth. So don’t worry about the distance you've walked or the mistakes you've made. Come as you are, with your doubts, your regrets, and your tired heart. Every step you take toward Him, He runs toward you. Every moment you think of Him, He thinks of you. Every whispered “astaghfurullah” is heard before it even leaves your lips.\nYou are not too far, ya umre. You were never too far. And ma tense — I'm here to help you in any way you need. To remind you, to support you, to be your hand when you reach out. Whenever you're ready to return, I’ll be right beside you. I’ll stand with you through everything in your life.",
        "verse": "قُلْ يَـٰعِبَادِىَ ٱلَّذِينَ أَسْرَفُوا۟ عَلَىٰٓ أَنفُسِهِمْ لَا تَقْنَطُوا۟ مِن رَّحْمَةِ ٱللَّهِ ۚ إِنَّ ٱللَّهَ يَغْفِرُ ٱلذُّنُوبَ جَمِيعًا ۚ إِنَّهُۥ هُوَ ٱلْغَفُورُ ٱلرَّحِيمُ ٥٣"
    },
    {
        "title": "When life feels heavy",
        "heading": "My love,",
        "content": "I'm so sorry that life feels heavy right now. I won't tell you that everything happens for a reason, laeno I know that when you're hurting, those words can feel empty. Instead, I'll tell you: you are seen. Your struggle is not invisible, not to Allah, and not to me.\nCome to me, ehkile shu aam ysir, let me hold some of this weight with you. You don’t have to pretend to be strong every second. You’re allowed to cry, to pause, and to lean on the people who love you.\nWhat you’re feeling right now will not last forever. The heaviness you're carrying is temporary, even if it doesn’t feel like it. There will come a day, sooner than you think, where this weight will become lighter, and peace will quietly take its place.\nAllah may test His strongest soldiers, but He never leaves them alone. Not for a moment. He is closer to you during hardship than during ease. The weight will ease. The dawn will come. Relief is already on its way to you, even if you can’t see it yet.\nUntil then, remember this: you are stronger than you think, and you are loved more than you know by me, by Allah, and by the people who care about you more than you realise.\nSo tell me your problems. Let me carry them with you. Let me sit with you in the heaviness until it becomes light again. You don’t have to handle life alone. I’m here, and I’m not going anywhere.\nI love you.",
        "verse": "مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ ٣"
    }
]