[
    {
        "type": "verse",
        "text": "أُو۟لَـٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَـٰٓئِكَ هُمُ ٱلْمُفْلِحُونَ ٥",
        "reference": "Quran 94:5",
        "reflection": "You are guided by Allah. Every step you take is a step in the path Allah has set for you and a step towards success."
    },
    {
        "type": "verse",
        "text": "وَهُوَ مَعَكُمْ أَيْنَ مَا كُنتُمْ",
        "reference": "Quran 57:4",
        "reflection": "In your loneliest moments, in your darkest nights, He is there. You are never truly alone."
    },
    {
        "type": "dua",
        "text": "O Allah, I seek refuge in You from anxiety and sorrow, weakness and laziness.",
        "reference": "Dua for Relief",
        "reflection": "When the weight feels unbearable, turn to Him. He is the One who lifts all burdens."
    },
    {
        "type": "verse",
        "text": "وَلَا تَهِنُوا۟ وَلَا تَحْزَنُوا۟ وَأَنتُمُ ٱلْأَعْلَوْنَ إِن كُنتُم مُّؤْمِنِينَ ١٣٩",
        "reference": "Quran 3:139",
        "reflection": "Your struggles are not signs of defeat. They are part of your journey to victory. You have the upper hand by being Allah's follower."
    },
    {
        "type": "verse",
        "text": "إِنَّ رَبِّى قَرِيبٌۭ مُّجِيبٌۭ",
        "reference": "Quran 11:61",
        "reflection": "Your prayers are not lost in the void. He hears every whisper of your heart."
    },
    {
        "type": "dua",
        "text": "حَسْبُنَا ٱللَّهُ وَنِعْمَ ٱلْوَكِيلُ",
        "reference": "Quran 3:173",
        "reflection": "When you feel powerless, remember that the Most Powerful is taking care of you as He is the disposer of affairs."
    },
    {
        "type": "verse",
        "text": "لَا يُكَلِّفُ ٱللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ",
        "reference": "Quran 2:286",
        "reflection": "If you are going through this, it means you have the strength to endure it. He knows you can. He believes in your strength just like I do."
    },
    {
        "type": "reflection",
        "text": "Your tears are not wasted. They are prayers too precious for words.",
        "reference": "A Reminder",
        "reflection": "Every time you cry seeking Him, you draw closer. Tears of sincerity purify the heart."
    },
    {
        "type": "verse",
        "text": "فَٱذْكُرُونِىٓ أَذْكُرْكُمْ وَٱشْكُرُوا۟ لِى وَلَا تَكْفُرُونِ ١٥٢",
        "reference": "Quran 2:152",
        "reflection": "Turning your heart to Him in gratitude keeps your soul anchored even in uncertainty."
    },
    {
        "type": "verse",
        "text": "يَـٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوا۟ ٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ ١٥٣",
        "reference": "Quran 2:153",
        "reflection": "Patience is not passive. It is the quiet strength that carries you through trials. Be patient and trust in Allah."
    },
    {
        "type": "dua",
        "text": "O Allah, guide me and make my affairs easy for me.",
        "reference": "Dua for Guidance",
        "reflection": "Whenever you feel lost, ask Him for guidance. He opens the paths that seem hidden."
    },
    {
        "type": "verse",
        "text": "وَمَن يَتَّقِ ٱللَّهَ يَجْعَل لَّهُۥ مَخْرَجًۭا",
        "reference": "Quran 65:2",
        "reflection": "Trust that obedience and consciousness of Him will always create solutions, even when it doesn't seem that way."
    },
    {
        "type": "reflection",
        "text": "Even the smallest remembrance brings peace to a restless heart.",
        "reference": "Daily Reminder",
        "reflection": "A few seconds of sincere zikr can transform anxiety into peace."
    },
    {
        "type": "dua",
        "text": "O Allah, grant me strength when I am weak, and patience when I am tired.",
        "reference": "Personal Dua",
        "reflection": "Acknowledging your weakness and seeking His help is the first step toward real strength."
    },
    {
        "type": "verse",
        "text": "وَٱسْتَعِينُوا۟ بِٱلصَّبْرِ وَٱلصَّلَوٰةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلْخَـٰشِعِينَ ٤٥",
        "reference": "Quran 2:45",
        "reflection": "When life seems overwhelming, patience paired with prayer softens the heart and illuminates the path."
    },
    {
        "type": "reflection",
        "text": "Every hardship carries a lesson, every loss carries a reminder.",
        "reference": "Life Reflection",
        "reflection": "Look for the hidden wisdom in your struggles; the heart that learns becomes stronger and more serene."
    },
    {
        "type": "verse",
        "text": "وَتَوَكَّلْ عَلَى ٱللَّهِ ۚ وَكَفَىٰ بِٱللَّهِ وَكِيلًۭا ٣",
        "reference": "Quran 33:3",
        "reflection": "Let go of what you cannot control and trust that He is managing everything for your good."
    },
    {
        "type": "verse",
        "text": "فَٱللَّهُ خَيْرٌ حَـٰفِظًۭا ۖ وَهُوَ أَرْحَمُ ٱلرَّٰحِمِينَ",
        "reference": "Quran 12:64",
        "reflection": "No matter the fear or danger, He shields and watches over you with mercy."
    },
    {
        "type": "dua",
        "text": "O Allah, grant me a heart that is content and a mind that is at peace.",
        "reference": "Dua for Peace",
        "reflection": "Contentment begins in the heart and grows with reliance on Him."
    },
    {
        "type": "verse",
        "text": "وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ ۚ وَمَن يَتَوَكَّلْ عَلَى ٱللَّهِ فَهُوَ حَسْبُهُۥٓ ۚ إِنَّ ٱللَّهَ بَـٰلِغُ أَمْرِهِۦ ۚ قَدْ جَعَلَ ٱللَّهُ لِكُلِّ شَىْءٍۢ قَدْرًۭا ٣",
        "reference": "Quran 65:3",
        "reflection": "When you surrender your worries to Him, He provides what you need and more. Livelihead and happiness will come when you least expect it."
    },
    {
        "type": "reflection",
        "text": "Even the darkest night is followed by light.",
        "reference": "Hope Reminder",
        "reflection": "No matter how lost or heavy your heart feels, relief is coming from Him."
    },
    {
        "type": "dua",
        "text": "O Allah, forgive me and have mercy upon me in ways I cannot see.",
        "reference": "Dua for Mercy",
        "reflection": "Trust that His mercy is infinite and always present, even when we feel unworthy."
    },
    {
        "type": "verse",
        "text": "إِنَّ ٱللَّهَ لَا يُغَيِّرُ مَا بِقَوْمٍ حَتَّىٰ يُغَيِّرُوا۟ مَا بِأَنفُسِهِمْ ۗ",
        "reference": "Quran 13:11",
        "reflection": "Take the small steps today that move your heart closer to Him. He will support the change."
    },
    {
        "type": "verse",
        "text": "إِنَّ مَعَ ٱلْعُسْرِ يُسْرًۭا ٦",
        "reference": "Quran 94:6",
        "reflection": "Every challenge is paired with relief. Look for it, and let hope anchor your heart."
    },
    {
        "type": "reflection",
        "text": "Sincerity in small deeds matters more than the size of the act.",
        "reference": "Spiritual Reminder",
        "reflection": "Your prayers, intentions, and good deeds, even if small, carry immense weight in His eyes."
    },
    {
        "type": "dua",
        "text": "O Allah, purify my heart and remove the burdens of my soul.",
        "reference": "Dua for Purity",
        "reflection": "Ask Him to cleanse your heart from worry and heaviness; He responds with lightness."
    },
    {
        "type": "verse",
        "text": "فَٱسْتَغْفِرُوهُ ثُمَّ تُوبُوٓا۟ إِلَيْهِ ۚ إِنَّ رَبِّى قَرِيبٌۭ مُّجِيبٌۭ",
        "reference": "Quran 11:61",
        "reflection": "Speak to Him openly. No prayer is too small, no whisper unheard."
    },
    {
        "type": "verse",
        "text": "وَٱصْبِرُوٓا۟ ۚ إِنَّ ٱللَّهَ مَعَ ٱلصَّـٰبِرِينَ",
        "reference": "Quran 8:46",
        "reflection": "Patience strengthens faith and softens the heart during trials. Even if you're impatient, try your best to be patient and trust it."
    },
    {
        "type": "verse",
        "text": "وَوَجَدَكَ ضَآلًّۭا فَهَدَىٰ ٧ وَوَجَدَكَ عَآئِلًۭا فَأَغْنَىٰ ٨",
        "reference": "Quran 93:7-8",
        "reflection": "Even when you feel completely lost, His guidance is always ready for you."
    },
    {
        "type": "verse",
        "text": "لَا تَحْزَنْ إِنَّ ٱللَّهَ مَعَنَا ۖ",
        "reference": "Quran 9:40",
        "reflection": "You are never truly alone. He walks with you through every fear and sorrow."
    }
]
